src/Documents/уатПрочиеДоходыРасходы/уатПрочиеДоходыРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатПрочиеДоходыРасходы</name>
  <basedOn>Document.уатОтчетСистемыПлатон</basedOn>
  <basedOn>Document.уатПарковка</basedOn>
  <basedOn>Document.уатСписаниеТоваров</basedOn>
  <basedOn>Document.уатРемонтныйЛист</basedOn>
  <basedOn>Document.уатОтчетСистемыАвтодор</basedOn>
  <registerRecords>AccumulationRegister.уатРасходы</registerRecords>
  <registerRecords>AccumulationRegister.уатДоходы</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <comment>Вид операции</comment>
    <type>
      <types>EnumRef.уатВидыОперацийПрочиеДоходыРасходы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Колонна</name>
    <type>
      <types>CatalogRef.уатКолонны</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <comment>Валюта документа</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>Сумма в валюте документа, налоги включены согласно флагам</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьНДС</name>
    <comment>Учитывать НДС</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <comment>Сумма включает НДС</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Документ основание</comment>
    <type>
      <types>DocumentRef.уатПарковка</types>
      <types>DocumentRef.уатОтчетСистемыПлатон</types>
      <types>DocumentRef.уатРемонтныйЛист</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Расходы</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>ДатаОтражения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.уатСтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТС</name>
      <type>
        <types>CatalogRef.уатТС</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.уатЗаказГрузоотправителя</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>Сумма в валюте регл. учета</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>Ставка НДС</comment>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>Сумма НДС в валюте регл. учета</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <comment>(Регл)</comment>
      <type>
        <types>ChartOfAccountsRef.уатРегламентированный</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатурнаяГруппа</name>
      <comment>(Упр)</comment>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектСтроительства</name>
      <type>
        <types>CatalogRef.уатОбъектыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>Маршрут</name>
      <type>
        <types>CatalogRef.уатМаршруты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПеревозки</name>
      <type>
        <types>CatalogRef.уатВидыПеревозок</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеПеревозки</name>
      <type>
        <types>CatalogRef.уатНаправленияПеревозок</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Доходы</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>ДатаОтражения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДоходов</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.уатСтатьиДоходов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТС</name>
      <type>
        <types>CatalogRef.уатТС</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.уатЗаказГрузоотправителя</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>Сумма в валюте регл. учета</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>Ставка НДС</comment>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>Сумма НДС в валюте регл. учета</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектСтроительства</name>
      <type>
        <types>CatalogRef.уатОбъектыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>Маршрут</name>
      <type>
        <types>CatalogRef.уатМаршруты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПеревозки</name>
      <type>
        <types>CatalogRef.уатВидыПеревозок</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеПеревозки</name>
      <type>
        <types>CatalogRef.уатНаправленияПеревозок</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/уатВидыОперацийПрочиеДоходыРасходы/уатВидыОперацийПрочиеДоходыРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатВидыОперацийПрочиеДоходыРасходы</name>
  <enumValues>
    <name>Доходы</name>
  </enumValues>
  <enumValues>
    <name>Расходы</name>
  </enumValues>
</mdclass:Enum>

src/Documents/уатПрочиеДоходыРасходы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	// необходима для подключения внешних ПФ
	Заглушка = Истина;
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.УправлениеДоступом

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ВариантыОтчетов

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	мЗапрос = Новый Запрос;
	Если ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийПрочиеДоходыРасходы.Доходы Тогда
		мЗапрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатПрочиеДоходыРасходы.ДатаОтражения КАК Период,
		|	уатПрочиеДоходыРасходы.Ссылка КАК Регистратор,
		|	уатПрочиеДоходыРасходы.Ссылка.Организация КАК Организация,
		|	уатПрочиеДоходыРасходы.Ссылка.Подразделение КАК Подразделение,
		|	уатПрочиеДоходыРасходы.Ссылка.Колонна КАК Колонна,
		|	уатПрочиеДоходыРасходы.ТС КАК ТС,
		|	уатПрочиеДоходыРасходы.СтатьяДоходов КАК СтатьяДоходов,
		|	уатПрочиеДоходыРасходы.Сумма КАК Сумма,
		|	уатПрочиеДоходыРасходы.Сумма КАК СуммаРегл,
		|	уатПрочиеДоходыРасходы.Сумма КАК СуммаУпр,
		|	ВЫБОР
		|		КОГДА уатПрочиеДоходыРасходы.Ссылка.УчитыватьНДС
		|			ТОГДА уатПрочиеДоходыРасходы.СуммаНДС
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА уатПрочиеДоходыРасходы.Ссылка.УчитыватьНДС
		|			ТОГДА уатПрочиеДоходыРасходы.СуммаНДС
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаНДСУпр,
		|	уатПрочиеДоходыРасходы.Заказ КАК Заказ,
		|	уатПрочиеДоходыРасходы.Заказ.Ответственный КАК Менеджер,
		|	уатПрочиеДоходыРасходы.Контрагент КАК Контрагент,
		|	уатПрочиеДоходыРасходы.ОбъектСтроительства КАК ОбъектСтроительства,
		|	уатПрочиеДоходыРасходы.Маршрут КАК Маршрут,
		|	уатПрочиеДоходыРасходы.ВидПеревозки КАК ВидПеревозки,
		|	уатПрочиеДоходыРасходы.НаправлениеПеревозки КАК НаправлениеПеревозки
		|ИЗ
		|	Документ.уатПрочиеДоходыРасходы.Доходы КАК уатПрочиеДоходыРасходы
		|ГДЕ
		|	уатПрочиеДоходыРасходы.Ссылка = &Ссылка";
	Иначе
		мЗапрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатПрочиеДоходыРасходы.ДатаОтражения КАК Период,
		|	уатПрочиеДоходыРасходы.Ссылка КАК Регистратор,
		|	уатПрочиеДоходыРасходы.Ссылка.Организация КАК Организация,
		|	уатПрочиеДоходыРасходы.Ссылка.Подразделение КАК Подразделение,
		|	уатПрочиеДоходыРасходы.Ссылка.Колонна КАК Колонна,
		|	уатПрочиеДоходыРасходы.ТС КАК ТС,
		|	уатПрочиеДоходыРасходы.СтатьяРасходов,
		|	уатПрочиеДоходыРасходы.Сумма КАК Сумма,
		|	уатПрочиеДоходыРасходы.Сумма КАК СуммаРегл,
		|	уатПрочиеДоходыРасходы.Сумма КАК СуммаУпр,
		|	ВЫБОР
		|		КОГДА уатПрочиеДоходыРасходы.Ссылка.УчитыватьНДС
		|			ТОГДА уатПрочиеДоходыРасходы.СуммаНДС
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА уатПрочиеДоходыРасходы.Ссылка.УчитыватьНДС
		|			ТОГДА уатПрочиеДоходыРасходы.СуммаНДС
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаНДСУпр,
		|	уатПрочиеДоходыРасходы.Заказ,
		|	уатПрочиеДоходыРасходы.Заказ.Ответственный КАК Менеджер,
		|	уатПрочиеДоходыРасходы.Контрагент КАК Контрагент,
		|	уатПрочиеДоходыРасходы.ОбъектСтроительства КАК ОбъектСтроительства,
		|	уатПрочиеДоходыРасходы.Маршрут КАК Маршрут,
		|	уатПрочиеДоходыРасходы.ВидПеревозки КАК ВидПеревозки,
		|	уатПрочиеДоходыРасходы.НаправлениеПеревозки КАК НаправлениеПеревозки
		|ИЗ
		|	Документ.уатПрочиеДоходыРасходы.Расходы КАК уатПрочиеДоходыРасходы
		|ГДЕ
		|	уатПрочиеДоходыРасходы.Ссылка = &Ссылка";
	КонецЕсли;
	
	мЗапрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	ТаблицаДокумента = мЗапрос.Выполнить().Выгрузить();
	
	ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
	Если уатОбщегоНазначенияТиповые.уатЕстьКонстанта("ВалютаУправленческогоУчета") Тогда 
		ВалютаУпр = Константы.ВалютаУправленческогоУчета.Получить();
	Иначе
		ВалютаУпр = ВалютаРегл;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из ТаблицаДокумента Цикл
		СуммаВсего = ТекСтрока.Сумма + ?(ДокументСсылка.УчитыватьНДС И НЕ ДокументСсылка.СуммаВключаетНДС, ТекСтрока.СуммаНДС, 0);		
		
		ТекСтрока.СуммаРегл   = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(СуммаВсего,
			ДокументСсылка.ВалютаДокумента, ВалютаРегл, ДокументСсылка.Дата, ДокументСсылка.Дата);
		ТекСтрока.СуммаУпр    = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(СуммаВсего,
			ДокументСсылка.ВалютаДокумента, ВалютаУпр, ДокументСсылка.Дата, ДокументСсылка.Дата);
		ТекСтрока.СуммаНДС    = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаНДС,
			ДокументСсылка.ВалютаДокумента, ВалютаРегл, ДокументСсылка.Дата, ДокументСсылка.Дата);
		ТекСтрока.СуммаНДСУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаНДСУпр,
			ДокументСсылка.ВалютаДокумента, ВалютаУпр, ДокументСсылка.Дата, ДокументСсылка.Дата);
	КонецЦикла;
	
	уатРасчетыПоТарифам_уэ.РаспределитьДоходыРасходыМеждуЗаказами(ТаблицаДокумента);
	
	Если ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийПрочиеДоходыРасходы.Доходы Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходы", ТаблицаДокумента);
	Иначе
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасходы", ТаблицаДокумента);
	КонецЕсли;
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Заглушка = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
